In [1]:
import numpy as np
import pandas as pd

In [6]:
d={'A':[1,2,np.nan,3],'B':[1,np.nan,np.nan,2],'C':[np.nan,np.nan,np.nan,5],'D':[1,2,3,4]}
df=pd.DataFrame(d)

In [7]:
df

     A    B    C  D
0  1.0  1.0  NaN  1
1  2.0  NaN  NaN  2
2  NaN  NaN  NaN  3
3  3.0  2.0  5.0  4

In [8]:
df.dropna()

     A    B    C  D
3  3.0  2.0  5.0  4

In [9]:
df.dropna(axis=1)

   D
0  1
1  2
2  3
3  4

In [10]:
df.dropna(thresh=2)

     A    B    C  D
0  1.0  1.0  NaN  1
1  2.0  NaN  NaN  2
3  3.0  2.0  5.0  4

In [11]:
df.dropna(thresh=2,axis=1)

     A    B  D
0  1.0  1.0  1
1  2.0  NaN  2
2  NaN  NaN  3
3  3.0  2.0  4

In [12]:
df.fillna('FILL_VALUE')

            A           B           C  D
0         1.0         1.0  FILL_VALUE  1
1         2.0  FILL_VALUE  FILL_VALUE  2
2  FILL_VALUE  FILL_VALUE  FILL_VALUE  3
3         3.0         2.0         5.0  4

In [14]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    2.0
3    3.0
Name: A, dtype: float64